export const mobile = /^(?:1\d{2})-?\d{5}(\d{3}|\*{3})$/; // 手机号码

export const qq = /^[1-9][0-9]{4,9}$/; // QQ

export const befitName = /^[a-z0-9A-Z\u4e00-\u9fa5]+$/; // 合适的用户名，中文,字母,数字

export const befitPwd = /^[a-z0-9A-Z_]+$/; // 合适的密码，字母,数字,下划线

export const allNumber = /^[0-9]+.?[0-9]$/; // 全部为数字
// phone: /^(((13[0-9]{1})|(14[7]{1})|(15[0-35-9]{1})|(17[0-9]{1})|(18[0-9]{1})|(19[0-9]{1}))+\d{8})$/, // 手机号
export const phone =
  /(^(((13[0-9]{1})|(14[7]{1})|(15[0-35-9]{1})|(16[0-9]{1})|(17[0-9]{1})|(18[0-9]{1})|(19[0-9]{1}))+\d{8})$)|(^(0[0-9]{2,3}\-)([2-9][0-9]{6,7})+(\-[0-9]{1,4})?$)/; // 手机号+座机

export const regEn = /[`~!@#$%^&*()+<>?:"{},.\/;'[\]]/im; // 英文非法字符

export const regCn = /[·！#￥（——）：；“”‘、，|《。》？、【】[\]]/im; // 中文非法字符

export const idCard = /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/; // 身份证号

export const passport = /^[a-zA-Z0-9]{5,17}$/; // 护照

export const intNum = /^[1-9]([0-9])*$/; // 正整数

export const email =
  /^([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}$/; // 邮箱

export const phoneAndTel = /(^0\d{2,3}\-\d{7,8}$)|(^1[3|4|5|6|7|8|9][0-9]{9}$)/; // 手机号和固话一起验证

export const notCh = /^[0-9a-zA-Z_]+$/; // 数字或英文字母

export const ipAddrss =
  /^(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])$/; // IP地址

export const port =
  /^([0-9]|[1-9]\d{1,3}|[1-5]\d{4}|6[0-4]\d{3}|65[0-4]\d{2}|655[0-2]\d|6553[0-5])$/;

export const numX = /^[0-9A-Z]+$/; // 数字或大写英文字母

export const creditCode = /^([0-9A-HJ-NPQRTUWXY]{2}\d{6}[0-9A-HJ-NPQRTUWXY]{10}|[1-9]\d{14})$/; // 统一社会信用代码

//校验密码大小写数字特殊符号
export const passWordRule =
  /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[$@$!%*?&])[A-Za-z\d$@$!%*?&]{8,20}/;
